#+TITLE: orgmode examples
#+SUBTITLE: draw, code evaluation and present in orgmode with \LaTeX{} beamer
:SETTINGS:
#+AUTHOR: kimim
#+STARTUP: show3levels
#+OPTIONS: H:2 toc:t num:t date:t author:t
#+BEAMER_THEME: hippo
#+LATEX_HEADER: \addbibresource{references.bib}
#+bibliography: references.bib
:END:

** table formula

|           |        |   |   |   |
|-----------+--------+---+---+---|
|         2 |      1 |   |   |   |
|         2 |        |   |   |   |
|         2 |      1 |   |   |   |
|-----------+--------+---+---+---|
| [2, 2, 2] | [1, 1] |   |   |   |
|         3 |      2 |   |   |   |
|         6 |      2 |   |   |   |
#+TBLFM: @5$1=(@I..II)::@5$2=(@I..II)
#+TBLFM: @6$1='(length '(@I..II))::@6$2='(length '(@I..II))
#+TBLFM: @7$1='(apply '+ '(@I..II));N::@7$2='(apply '+ '(@I..II));N

